import { createHash } from 'crypto'

let Reg = /\|?(.*)([.|] *?)([0-9]*)$/i
let handler = async function (m, { text, usedPrefix }) {
  let user = global.db.data.users[m.sender]
  if (user.registered === true) throw `أنت مسجّل بالفعل\nهل تريد إعادة التسجيل؟ ${usedPrefix}شطب <الرقم التسلسلي>\n\n• لعرض رقمك التسلسلي ومعلوماتك ارسل الأمر : *.تسجيلي*`
  if (!Reg.test(text)) throw `❌ صيغة خاطئة\n*${usedPrefix}تسجيل الاسم.العمر*\nملاحظة : يجب وضع نقطة مابين الاسم والعمر دون ترك مسافات`
  let [_, name, splitter, age] = text.match(Reg)
  if (!name) throw '❌ الاسم لا يمكن أن يكون فارغاً (أحرف وأرقام فقط)'
  if (!age) throw '❌ العمر لا يمكن أن يكون فارغاً (أرقام فقط)'
  age = parseInt(age)
  if (age > 120) throw '❌ العمر كبير جداً 😂'
  if (age < 15) throw '❌ الأعمار تحت 15 سنة غير مسموحة 😂'
  user.name = name.trim()
  user.age = age
  user.regTime = + new Date
  user.registered = true
  let sn = createHash('md5').update(m.sender).digest('hex')
  m.reply(`
✅ تم التسجيل بنجاح!

╭─「 معلومات التسجيل 」
│ الاسم: ${name}
│ العمر: ${age} سنة
╰────
الرقم التسلسلي: 
${sn}

*شروط الاستخدام (TOS) - Yato Bot - MD*
باستخدامك للبوت Yato Bot - MD فأنت توافق على الشروط التالية:

1. *ممنوع منعاً باتاً التلاعب بالمؤقت/الرسائل المؤقتة*  
سيقوم البوت بحظر رقمك تلقائياً، ولإلغاء الحظر تواصل مع المطور (+967781994494).

2. *ممنوع إرسال محتوى غير لائق (NSFW)*  
البوت يكتشف الوسائط غير اللائقة تلقائياً وسيقوم بحظر رقمك، لإلغاء الحظر تواصل مع المطور (+967781994494).

3. *ممنوع إرسال سبام (إزعاج) لرقم البوت*  
سيقوم البوت بعمل حظر دائم إذا اكتشف نشاط سبام على رقمك.

4. *تواصل مع المطور عند الحاجة فقط*  
لا فائدة من مراسلة رقم البوت، لأن الرسائل محفوظة في السيرفر والمطور لن يراها.

باستخدامك للبوت Yato Bot - MD، فأنت توافق على جميع الشروط أعلاه.

*آخر تحديث لهذه الشروط كان بتاريخ 12 مايو 2024.*

📌 التسجيل يعني موافقتك على الشروط
`.trim())
}

handler.tags = ['main']
handler.help = ['تسجيل'] // .map(v => v + ' <الاسم>.<العمر>')
handler.command = /^(سجل|تسجيل|daftar|reg(ister)?)$/i

export default handler